_posts/2016-02-20-Generating-an-alphabetized-list-of-collaborators-from-the-past-five-years.html
---
title: Generating an alphabetized list of collaborators from the past five years
date: 2016/02/20 17:03:13
updated: 2016/02/20 17:24:16
categories: python,scopus
tags: 
---


<p>
Almost every proposal I write requires some list of my coauthors from the past several years. Some want the list alphabetized, and some want affiliations too. It has always bothered me to make this list, mostly because it is tedious, and it seems like something that should not be hard to generate. It turns out it is not too hard. I have been developing a Python interface ((<a href="https://github.com/jkitchin/scopus">https://github.com/jkitchin/scopus</a> )) to <a href="http://scopus.com">Scopus</a> that more or less enables me to script this.
</p>

<p>
Scopus is not free. You need either a license, or institutional access to use it. Here is the strategy to generate my list of coauthors. First, we need to get the articles for the past 5 years that are mine, and for each paper we get the coauthors. I use my Scopus author id in the query, and then sort the names alphabetically into a table. Then, I use that table as input to a second code block that does an author query in Scopus to get the current affiliations. Here is the code.
</p>

<div class="org-src-container">

<pre class="src src-python" id="coauthors"><span style="color: #0000FF;">from</span> scopus.scopus_api <span style="color: #0000FF;">import</span> ScopusAbstract
<span style="color: #0000FF;">from</span> scopus.scopus_search <span style="color: #0000FF;">import</span> ScopusSearch

<span style="color: #BA36A5;">s</span> = ScopusSearch(<span style="color: #008000;">'AU-ID(7004212771) AND PUBYEAR &gt; 2010'</span>)

<span style="color: #BA36A5;">coauthors</span> = {}
<span style="color: #0000FF;">for</span> eid <span style="color: #0000FF;">in</span> s.EIDS:
    <span style="color: #BA36A5;">ab</span> = ScopusAbstract(eid)
    <span style="color: #0000FF;">for</span> au <span style="color: #0000FF;">in</span> ab.authors:
        <span style="color: #0000FF;">if</span> au.auid <span style="color: #0000FF;">not</span> <span style="color: #0000FF;">in</span> coauthors <span style="color: #0000FF;">and</span> au.auid != <span style="color: #008000;">'7004212771'</span>:
            <span style="color: #BA36A5;">coauthors</span>[au.auid] = au.indexed_name

<span style="color: #0000FF;">return</span> <span style="color: #006FE0;">sorted</span>([[auid, name] <span style="color: #0000FF;">for</span> auid,name <span style="color: #0000FF;">in</span> coauthors.items()], key=<span style="color: #0000FF;">lambda</span> x:x[1])
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="right">52463103500</td>
<td class="left">Akhade S.A.</td>
</tr>

<tr>
<td class="right">6506329719</td>
<td class="left">Albenze E.</td>
</tr>

<tr>
<td class="right">36472906200</td>
<td class="left">Alesi W.R.</td>
</tr>

<tr>
<td class="right">56963752500</td>
<td class="left">Anna S.L.</td>
</tr>

<tr>
<td class="right">56522803500</td>
<td class="left">Boes J.R.</td>
</tr>

<tr>
<td class="right">26433085700</td>
<td class="left">Calle-Vallejo F.</td>
</tr>

<tr>
<td class="right">54973276000</td>
<td class="left">Chao R.</td>
</tr>

<tr>
<td class="right">7201800897</td>
<td class="left">Collins T.J.</td>
</tr>

<tr>
<td class="right">54883867200</td>
<td class="left">Curnan M.T.</td>
</tr>

<tr>
<td class="right">7003584159</td>
<td class="left">Damodaran K.</td>
</tr>

<tr>
<td class="right">55328415000</td>
<td class="left">Demeter E.L.</td>
</tr>

<tr>
<td class="right">37005464900</td>
<td class="left">Dsilva C.</td>
</tr>

<tr>
<td class="right">18037364800</td>
<td class="left">Egbebi A.</td>
</tr>

<tr>
<td class="right">35603120700</td>
<td class="left">Eslick J.C.</td>
</tr>

<tr>
<td class="right">56673468200</td>
<td class="left">Fan Q.</td>
</tr>

<tr>
<td class="right">24404182600</td>
<td class="left">Frenkel A.I.</td>
</tr>

<tr>
<td class="right">35514271900</td>
<td class="left">Gellman A.J.</td>
</tr>

<tr>
<td class="right">12803603300</td>
<td class="left">Gerdes K.</td>
</tr>

<tr>
<td class="right">54585146800</td>
<td class="left">Gumuslu G.</td>
</tr>

<tr>
<td class="right">55569145100</td>
<td class="left">Hallenbeck A.P.</td>
</tr>

<tr>
<td class="right">24316829300</td>
<td class="left">Hansen H.A.</td>
</tr>

<tr>
<td class="right">56009239000</td>
<td class="left">Hilburg S.L.</td>
</tr>

<tr>
<td class="right">55676869000</td>
<td class="left">Hopkinson D.</td>
</tr>

<tr>
<td class="right">56674328100</td>
<td class="left">Illes S.M.</td>
</tr>

<tr>
<td class="right">23479647900</td>
<td class="left">Inoglu N.G.</td>
</tr>

<tr>
<td class="right">6603398169</td>
<td class="left">Jaramillo T.F.</td>
</tr>

<tr>
<td class="right">8054222900</td>
<td class="left">Joshi Y.V.</td>
</tr>

<tr>
<td class="right">47962378000</td>
<td class="left">Keturakis C.</td>
</tr>

<tr>
<td class="right">57056061900</td>
<td class="left">Kondratyuk P.</td>
</tr>

<tr>
<td class="right">55391991800</td>
<td class="left">Kondratyuk P.</td>
</tr>

<tr>
<td class="right">7006205398</td>
<td class="left">Koper M.T.M.</td>
</tr>

<tr>
<td class="right">23004637900</td>
<td class="left">Kusuma V.A.</td>
</tr>

<tr>
<td class="right">35787409400</td>
<td class="left">Landon J.</td>
</tr>

<tr>
<td class="right">55005205100</td>
<td class="left">Lee A.S.</td>
</tr>

<tr>
<td class="right">6701399651</td>
<td class="left">Luebke D.R.</td>
</tr>

<tr>
<td class="right">35491189200</td>
<td class="left">Man I.C.</td>
</tr>

<tr>
<td class="right">27467500000</td>
<td class="left">Mantripragada H.</td>
</tr>

<tr>
<td class="right">55373026900</td>
<td class="left">Mao J.X.</td>
</tr>

<tr>
<td class="right">55210428500</td>
<td class="left">Marks A.</td>
</tr>

<tr>
<td class="right">27667815700</td>
<td class="left">Martinez J.I.</td>
</tr>

<tr>
<td class="right">56071079300</td>
<td class="left">Mehta P.</td>
</tr>

<tr>
<td class="right">56673592900</td>
<td class="left">Michael J.D.</td>
</tr>

<tr>
<td class="right">55772901000</td>
<td class="left">Miller D.C.</td>
</tr>

<tr>
<td class="right">7501599910</td>
<td class="left">Miller J.B.</td>
</tr>

<tr>
<td class="right">26032231600</td>
<td class="left">Miller S.D.</td>
</tr>

<tr>
<td class="right">35576929100</td>
<td class="left">Morreale B.</td>
</tr>

<tr>
<td class="right">55308251800</td>
<td class="left">Munprom R.</td>
</tr>

<tr>
<td class="right">14036290400</td>
<td class="left">Myers C.R.</td>
</tr>

<tr>
<td class="right">7007042214</td>
<td class="left">Norskov J.K.</td>
</tr>

<tr>
<td class="right">24081524800</td>
<td class="left">Nulwala H.B.</td>
</tr>

<tr>
<td class="right">56347288000</td>
<td class="left">Petrova R.</td>
</tr>

<tr>
<td class="right">7006208748</td>
<td class="left">Pushkarev V.V.</td>
</tr>

<tr>
<td class="right">56591664500</td>
<td class="left">Raman S.</td>
</tr>

<tr>
<td class="right">7004217247</td>
<td class="left">Resnik K.P.</td>
</tr>

<tr>
<td class="right">47962694800</td>
<td class="left">Richard Alesi Jr. W.</td>
</tr>

<tr>
<td class="right">9742604300</td>
<td class="left">Rossmeisl J.</td>
</tr>

<tr>
<td class="right">7201763336</td>
<td class="left">Rubin E.S.</td>
</tr>

<tr>
<td class="right">6602471339</td>
<td class="left">Sabolsky E.M.</td>
</tr>

<tr>
<td class="right">7004541416</td>
<td class="left">Salvador P.A.</td>
</tr>

<tr>
<td class="right">22981503200</td>
<td class="left">Shi W.</td>
</tr>

<tr>
<td class="right">55885836600</td>
<td class="left">Siefert N.S.</td>
</tr>

<tr>
<td class="right">25224517700</td>
<td class="left">Su H.-Y.</td>
</tr>

<tr>
<td class="right">57016792200</td>
<td class="left">Thirumalai H.</td>
</tr>

<tr>
<td class="right">8724572500</td>
<td class="left">Thompson R.L.</td>
</tr>

<tr>
<td class="right">8238710700</td>
<td class="left">Vasic R.</td>
</tr>

<tr>
<td class="right">37081979100</td>
<td class="left">Versteeg P.</td>
</tr>

<tr>
<td class="right">7006804734</td>
<td class="left">Wachs I.E.</td>
</tr>

<tr>
<td class="right">6701692232</td>
<td class="left">Washburn N.R.</td>
</tr>

<tr>
<td class="right">56542538800</td>
<td class="left">Watkins J.D.</td>
</tr>

<tr>
<td class="right">55569461200</td>
<td class="left">Xu Z.</td>
</tr>

<tr>
<td class="right">56424861600</td>
<td class="left">Yin C.</td>
</tr>

<tr>
<td class="right">56969809500</td>
<td class="left">Zhou X.</td>
</tr>
</tbody>
</table>

<p>
It is worth inspecting this list for duplicates. I see at least two duplicates. That is a limitation of almost every indexing service I have seen. Names are hard to disambiguate. I will live with it. Now, we will use another query to get affiliations, and the names. Since we use a sorted list from above, these names are in alphabetical order. We exclude co-authors from Carnegie Mellon University since these are often my students, or colleagues, and they are obvious conflicts of interest for proposal reviewing anyway. I split the current affiliation on a comma, since it appears the institution comes first, followed by the department. We only need an institution here.
</p>

<div class="org-src-container">

<pre class="src src-python"><span style="color: #0000FF;">from</span> scopus.scopus_author <span style="color: #0000FF;">import</span> ScopusAuthor

<span style="color: #BA36A5;">coauthors</span> = [ScopusAuthor(auid) <span style="color: #0000FF;">for</span> auid, name <span style="color: #0000FF;">in</span> data]

<span style="color: #0000FF;">print</span>(<span style="color: #008000;">', '</span>.join([<span style="color: #008000;">'{0} ({1})'</span>.<span style="color: #006FE0;">format</span>(au.name, au.current_affiliation.split(<span style="color: #008000;">','</span>)[0])
                 <span style="color: #0000FF;">for</span> au <span style="color: #0000FF;">in</span> coauthors
                 <span style="color: #0000FF;">if</span> au.current_affiliation.split(<span style="color: #008000;">','</span>)[0] != <span style="color: #008000;">'Carnegie Mellon University'</span>]))
</pre>
</div>

<pre class="example">
Sneha A. Akhade (Pennsylvania State University), Erik J. Albenze (National Energy Technology Laboratory), Federico Calle-Vallejo (Leiden Institute of Chemistry), Robin Chao (National Energy Technology Laboratory), Krishnan V. Damodaran (University of Pittsburgh), Carmeline J. Dsilva (Princeton University), Adefemi A. Egbebi (URS), John C. Eslick (National Energy Technology Laboratory), Anatoly I. Frenkel (Yeshiva University), Kirk R. Gerdes (National Energy Technology Laboratory), Heine Anton Hansen (Danmarks Tekniske Universitet), David P. Hopkinson (National Energy Technology Laboratory), Thomas Francisco Jaramillo (Fermi National Accelerator Laboratory), Yogesh V. Joshi (Exxon Mobil Research and Engineering), Christopher J. Keturakis (Lehigh University), Marc T M Koper (Leiden Institute of Chemistry), Victor A. Kusuma (National Energy Technology Laboratory), James Landon (University of Kentucky), David R. Luebke (Liquid Ion Solutions), Isabelacostinela Man (Universitatea din Bucuresti), James X. Mao (University of Pittsburgh), José Ignacio Martínez (CSIC - Instituto de Ciencia de Materiales de Madrid (ICMM)), David C M Miller (National Energy Technology Laboratory), Bryan D. Morreale (National Energy Technology Laboratory), Christina R. Myers (National Energy Technology Laboratory), Jens Kehlet Nørskov (Stanford Linear Accelerator Center), Rumyana V. Petrova (International Iberian Nanotechnology Laboratory), Vladimir V. Pushkarev (Dow Corning Corporation), Sumathy Raman (Exxon Mobil Research and Engineering), Kevin P. Resnik (URS), Walter Richard Alesi (National Energy Technology Laboratory), Jan Rossmeisl (Kobenhavns Universitet), Edward M. Sabolsky (West Virginia University), Wei Shi (University of Pittsburgh), Nicholas S. Siefert (National Energy Technology Laboratory), Haiyan Su (Dalian Institute of Chemical Physics Chinese Academy of Sciences), Robert Lee Thompson (University of Pittsburgh Medical Center), Relja Vasić (SUNY College of Nanoscale Science and Engineering), Israel E. Wachs (Lehigh University), John D. Watkins (National Energy Technology Laboratory), Chunrong Yin (United States Department of Energy), Xu Zhou (Liquid Ion Solutions)
</pre>

<p>
This is pretty sweet. I could pretty easily create a query that had all the PIs on a proposal, and alphabetize everyone's coauthors, or print them to a CSV file for import to Excel, or whatever format is required for conflict of interest reporting. The list is not perfect, but it is easy to manually fix it here.
</p>

<p>
That little bit of code is wrapped in a command-line utility in the scopus Python package. You use it like this. Just run it every time you need an updated list of coauthors! It isn't super flexible for now, e.g. excluding multiple affiliations, including multiple authors, etc&#x2026; isn't fully supported.
</p>

<div class="org-src-container">

<pre class="src src-sh">./scopus_coauthors 7004212771 2010 --exclude-affiliation=<span style="color: #008000;">"Carnegie Mellon University"</span>
</pre>
</div>

<pre class="example">
Sneha A. Akhade (Pennsylvania State University), Erik J. Albenze (National Energy Technology Laboratory), Federico Calle-Vallejo (Leiden Institute of Chemistry), Robin Chao (National Energy Technology Laboratory), Krishnan V. Damodaran (University of Pittsburgh), Carmeline J. Dsilva (Princeton University), Adefemi A. Egbebi (URS), John C. Eslick (National Energy Technology Laboratory), Anatoly I. Frenkel (Yeshiva University), Kirk R. Gerdes (National Energy Technology Laboratory), Heine Anton Hansen (Danmarks Tekniske Universitet), David P. Hopkinson (National Energy Technology Laboratory), Thomas Francisco Jaramillo (Fermi National Accelerator Laboratory), Yogesh V. Joshi (Exxon Mobil Research and Engineering), Christopher J. Keturakis (Lehigh University), Marc T M Koper (Leiden Institute of Chemistry), Victor A. Kusuma (National Energy Technology Laboratory), James Landon (University of Kentucky), David R. Luebke (Liquid Ion Solutions), Isabelacostinela Man (Universitatea din Bucuresti), James X. Mao (University of Pittsburgh), José Ignacio Martínez (CSIC - Instituto de Ciencia de Materiales de Madrid (ICMM)), David C M Miller (National Energy Technology Laboratory), Bryan D. Morreale (National Energy Technology Laboratory), Christina R. Myers (National Energy Technology Laboratory), Jens Kehlet Nørskov (Stanford Linear Accelerator Center), Rumyana V. Petrova (International Iberian Nanotechnology Laboratory), Vladimir V. Pushkarev (Dow Corning Corporation), Sumathy Raman (Exxon Mobil Research and Engineering), Kevin P. Resnik (URS), Walter Richard Alesi (National Energy Technology Laboratory), Jan Rossmeisl (Kobenhavns Universitet), Edward M. Sabolsky (West Virginia University), Wei Shi (University of Pittsburgh), Nicholas S. Siefert (National Energy Technology Laboratory), Haiyan Su (Dalian Institute of Chemical Physics Chinese Academy of Sciences), Robert Lee Thompson (University of Pittsburgh Medical Center), Relja Vasić (SUNY College of Nanoscale Science and Engineering), Israel E. Wachs (Lehigh University), John D. Watkins (National Energy Technology Laboratory), Chunrong Yin (United States Department of Energy), Xu Zhou (Liquid Ion Solutions)
</pre>
<p>Copyright (C) 2016 by John Kitchin. See the <a href="/copying.html">License</a> for information about copying.<p>
<p><a href="/org/2016/02/20/Generating-an-alphabetized-list-of-collaborators-from-the-past-five-years.org">org-mode source</a></p>
<p>Org-mode version = 8.2.10</p>